# https://github.com/Homebrew/homebrew-bundle

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "issenn/core"
tap "issenn/cask-versions"
tap "issenn/cask-fonts"
tap "issenn/kong"
tap "homebrew-ffmpeg/ffmpeg"

# Binaries
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "openssl@1.1"
brew "openldap"
brew "curl", link: false
brew "curl-openssl", link: false
brew "git"
brew "zsh"
brew "coreutils" # Those that come with macOS are outdated
brew "grep"
brew "make"
brew "cmake"
brew "gcc"
brew "gawk"
brew "gnu-sed"
brew "tree" # List directories in a tree structure

brew "neofetch"
brew "screenfetch"
brew "lolcat"
brew "pinentry-mac"
# brew "gpg"
brew "gnupg"
brew "stow"
brew "lua"
brew "tmux"
brew "reattach-to-user-namespace"
# brew "exa"
# brew "fzf"

brew "timewarrior"
brew "diff-so-fancy"
brew "annie"
brew "youtube-dl"

# brew "rbenv"
# brew "ruby-build"
# brew "readline"
# brew "rbenv-gemset"
# brew "rbenv-vars"

# brew 'awscli'
# brew 'bash' # Latest Bash version
# brew 'bat' # "cat" on steroids
# brew 'ffmpeg'
# brew 'gh'
# brew 'httpie'
# brew 'hub'
# brew 'mackup'
brew 'mas' # Mac App Store manager
# brew 'stripe'
# brew 'trash' # Manage the Trash bin
# brew 'zlib' # Needed for Memcached
# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@7.3'
# brew 'php@7.2'
# brew 'composer'
# brew 'imagemagick'
# brew 'mysql'
# brew 'nginx'
# brew 'node'
# brew 'redis'
# brew 'yarn'

# Fonts

cask "issenn/cask-fonts/font-meslo-nerd-font-patched"

# Apps
cask_args appdir: "/Applications"

cask "iterm2"
cask "istat-menus"
cask "shadowsocksx-ng-r"
cask "pritunl"
cask "google-chrome"
cask "visual-studio-code"
cask "sublime-text"
cask "typora"
cask "alacritty"
cask "vmware-fusion"
cask "docker"
cask "wechat"
cask "youdaonote"

# cask "beyond-compare"
# cask '1password'
# cask 'aerial'
# cask 'alfred'
# cask 'bartender'
# cask 'caffeine'
# cask 'discord'
# cask 'docker'
# cask 'firefox'
# cask 'github'
# cask 'google-backup-and-sync'
# cask 'google-chrome'
# cask 'gpg-suite'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'java'
# cask 'mysqlworkbench'
# cask 'nvidia-geforce-now'
# cask 'phpstorm'
# cask 'screenflow'
# cask 'skype'
# cask 'slack'
# cask 'steam'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'there'
# cask 'the-unarchiver'
# cask 'tor-browser'
# cask 'transmission'
# cask 'transmit'
# cask 'vagrant'
# cask 'virtualbox' # Might need to allow access in Security settings
# cask 'virtualbox-extension-pack'
# cask 'vlc'
# cask 'whatsapp'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-roboto-condensed'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas "1Password", id: 443987910
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005

# Do it
# brew bundle
